src/cf/Catalogs/CRM_ОбработчикиСобытийТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ОбработчикиСобытийТочекМаршрута</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТочкиМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_ВидыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ВидыТочекМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйБизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_ТочкиМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ТочкиМаршрутов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CRM_КартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Групповая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>Порядковый номер точки в карте маршрута</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВариантыЗавершенияБизнесПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОбработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогШаблоныОбработчиковБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогТипЗадачиИсполнителя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогТипЗадачиИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбработчикиСобытий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ОбработчикиСобытийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонОбработчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогШаблоныОбработчиковБизнесПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиРазделенияСлияния</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ВидыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыТочкиМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр1</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр2</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр3</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр4</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр5</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогШаблоныСтатусов</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
								<v8:Type>cfg:EnumRef.вогСтатусыДоговоровКоммерческихСоглашений</v8:Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.вогВопросы</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.вогВариантыОпросов</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_Классификаторы</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РедактируемыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъекту</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКРеквизиту</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписыватьВРежимеОбменДанными</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработчикПриЗаполнении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_ОбработчикиСобытийТочекМаршрута/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура УстановитьВидТочкиВОбработчиках() Экспорт
	
	// Вложенный бизнес-процесс
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ПриСозданииВложенногоБизнесПроцесса.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ПослеСозданияВложенногоБизнесПроцесса.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВложенныйБизнесПроцессПередСозданиемЗадач.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВложенныйБизнесПроцессПриСозданииЗадач.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс;
	СпрОбъект.Записать();
	
	// Выбор варианта
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВыборВарианта.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.ВыборВарианта;
	СпрОбъект.Записать();
	
	// Действие
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПриВыполнении.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Действие;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПослеВыполнения.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Действие;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПередСозданиемЗадач.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Действие;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПриСозданииЗадач.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Действие;
	СпрОбъект.Записать();
	
	// Завершение
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ЗавершениеПриЗавершении.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Завершение;
	СпрОбъект.Записать();
	
	// Обработка
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.Обработка.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Обработка;
	СпрОбъект.Записать();
	
	// Старт
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.СтартПередСтартом.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Старт;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.СтартПриСтарте.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Старт;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.СтартПослеСтарта.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Старт;
	СпрОбъект.Записать();
	
	// Условие
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.УсловиеПроверкаУсловия.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Условие;
	СпрОбъект.Записать();
	
	// Обработка
	СпрОбъект = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.Обработка.ПолучитьОбъект();
	СпрОбъект.ВидТочкиМаршрута = Перечисления.CRM_ВидыТочекМаршрута.Обработка;
	СпрОбъект.Записать();
	
	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Перечисления.CRM_ВидыТочекМаршрута.Действие);
	МассивВидов.Добавить(Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивВидов",МассивВидов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ТочкиМаршрутов.Ссылка,
	               |	CRM_ТочкиМаршрутов.Вид
	               |ИЗ
	               |	Справочник.CRM_ТочкиМаршрутов КАК CRM_ТочкиМаршрутов
	               |ГДЕ
	               |	CRM_ТочкиМаршрутов.Вид В(&МассивВидов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие Тогда
			СтрокаОбработчика = Выборка.Ссылка.ОбработчикиСобытий.Найти(Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПередСозданиемЗадач,"Событие");
		Иначе
			СтрокаОбработчика = Выборка.Ссылка.ОбработчикиСобытий.Найти(Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВложенныйБизнесПроцессПередСозданиемЗадач,"Событие");
		КонецЕсли;
		
		Если СтрокаОбработчика = Неопределено Тогда
			Точка = Выборка.Ссылка.ПолучитьОбъект();
			НоваяСтрока = Точка.ОбработчикиСобытий.Добавить();
			Если Выборка.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие Тогда
				НоваяСтрока.Событие = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПередСозданиемЗадач;
			Иначе
				НоваяСтрока.Событие = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВложенныйБизнесПроцессПередСозданиемЗадач;
			КонецЕсли;
			Точка.Записать();
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие Тогда
			СтрокаОбработчика = Выборка.Ссылка.ОбработчикиСобытий.Найти(Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПриСозданииЗадач,"Событие");
		Иначе
			СтрокаОбработчика = Выборка.Ссылка.ОбработчикиСобытий.Найти(Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВложенныйБизнесПроцессПриСозданииЗадач,"Событие");
		КонецЕсли;
		
		Если СтрокаОбработчика = Неопределено Тогда
			Точка = Выборка.Ссылка.ПолучитьОбъект();
			НоваяСтрока = Точка.ОбработчикиСобытий.Добавить();
			Если Выборка.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие Тогда
				НоваяСтрока.Событие = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ДействиеПриСозданииЗадач;
			Иначе
				НоваяСтрока.Событие = Справочники.CRM_ОбработчикиСобытийТочекМаршрута.ВложенныйБизнесПроцессПриСозданииЗадач;
			КонецЕсли;
			Точка.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
